Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ТоварларРегистрыНакопления Приход
	Движения.ТоварларРегистрыНакопления.Записывать = Истина;
	Для Каждого ТекСтрокаРуйхат Из Руйхат Цикл
		Движение = Движения.ТоварларРегистрыНакопления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаРуйхат.ТоварНоми;
		Движение.Сони = ТекСтрокаРуйхат.Сони;
		Движение.Нархи = ТекСтрокаРуйхат.Нархи;
		Движение.Суммаси = ТекСтрокаРуйхат.Суммаси;
	КонецЦикла;
КонецПроцедуры
